---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.EqualityConstraintsUnsatisfied
source: html/4125f1ab-8cb2-d711-69f5-a6fdbec7844b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.EqualityConstraintsUnsatisfied Property

Equality constraints are not satisfied. The action either violates a locked constraint or tries to modify
 a sketch based object outside of the sketch mode.

## Syntax (C#)
```csharp
public static FailureDefinitionId EqualityConstraintsUnsatisfied { get; }
```